//#include<iostream>
//using namespace std;
//
//class MM
//{
//public:
//	
//	MM( )
//	{ 
//		/*cout << "MM  " << endl;*/
//	}
//	MM(int k)
//	{
//		a = k;
//	}
//	int a;
//	~MM() {
//		cout << "析构函数" << endl;
//	}
//private:
//	static int  m;
//};
//
//int MM::m = 1;
//
//int main()
//{
//	// MM t;         //没有参数也不要去加括号
//	//MM *aa = new MM[3];
//	//int* p = new int[3];
//	//*p = 12;
//	////(aa[0]).a = 12;
//	//cout << *p << endl;
//
//	MM k(2);
//	k.~MM();
//	cout << k.a << endl;
//
//
//
//
//
//
//
//
//
//
//	while (1);
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
